<?php

//ده ملف الحذف من العربه
//هنا استدعاء للاتصال بقواعد البيانات
include("config.php");
//هنا الشرط لو جيت جابت الاي دي 
if (isset($_GET['id'])) {
    //هنا تنفيذ التعليمات لما الشرط يتحقق
    $ID =$_GET['id'];
//هنا كود الحذف ممن الجدول 
    mysqli_query($conn, "DELETE FROM mycar WHERE id=$ID");
//المفروض ده اشعار يظهر لما تحذف بس في مشكله انه مبيظهرش حلها بقا يا شاطر
    echo "<script>alert('تم رفع  ')</script>";
} else {
    echo "لم يتم توفير معرف ID في الرابط.";
}
//وهنا بقله يرجع فين لما يحذف 
header("location:user.php")
?>